In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
dict1={'Names':['ramesh','suresh',np.nan,'mahesh'],
       'age':[31,32,33,np.nan],
       'city':[np.nan,'hyd','mumbai','chennai']}

In [5]:
data1=pd.DataFrame(dict1)
data1

    Names   age     city
0  ramesh  31.0      NaN
1  suresh  32.0      hyd
2     NaN  33.0   mumbai
3  mahesh   NaN  chennai

In [6]:
data1.isnull().sum()/len(data1)

Names    0.25
age      0.25
city     0.25
dtype: float64

In [7]:
dict2={'Names':['ramesh','suresh',None,'mahesh'],
       'age':[31,32,33,None],
       'city':[None,'hyd','mumbai','chennai']}
data2=pd.DataFrame(dict2)
data2

    Names   age     city
0  ramesh  31.0     None
1  suresh  32.0      hyd
2    None  33.0   mumbai
3  mahesh   NaN  chennai

In [8]:
data2.isnull()

   Names    age   city
0  False  False   True
1  False  False  False
2   True  False  False
3  False   True  False

In [9]:
data2.isnull().sum()

Names    1
age      1
city     1
dtype: int64

In [10]:
dict3={'Names':['ramesh','suresh','Null','mahesh'],
       'age':[31,32,33,'Null'],
       'city':['Null','hyd','mumbai','chennai']}
data3=pd.DataFrame(dict3)
data3

    Names   age     city
0  ramesh    31     Null
1  suresh    32      hyd
2    Null    33   mumbai
3  mahesh  Null  chennai

In [12]:
data3.isnull()

   Names    age   city
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

$ METHODS-1$

In [ ]:
# fill the missing values with randoms number

In [13]:
data1.fillna(40)

    Names   age     city
0  ramesh  31.0       40
1  suresh  32.0      hyd
2      40  33.0   mumbai
3  mahesh  40.0  chennai

In [14]:
data1['Names'].fillna('sathish',inplace=True)
data1

     Names   age     city
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chennai

In [15]:
dict1={'Names':['ramesh','suresh',np.nan,'mahesh'],
       'age':[31,32,33,np.nan],
       'city':[np.nan,'hyd','mumbai','chennai']}

methods-3

In [17]:
data1.fillna(method='backfill')

     Names   age     city
0   ramesh  31.0      hyd
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chennai

In [18]:
data1.

     Names   age     city
0   ramesh  31.0      hyd
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chennai

mean

In [20]:
data1

     Names   age     city
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chennai

In [22]:
age_mean=data1['age'].mean()
age_mean

32.0

In [23]:
data1['age'].fillna(age_mean)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [24]:
age_median=data1['age'].median()
age_median

32.0

In [25]:
data1['age'].fillna(age_median)

0    31.0
1    32.0
2    33.0
3    32.0
Name: age, dtype: float64

In [26]:
age_mode=data1['age'].mode()
age_mode

0    31.0
1    32.0
2    33.0
Name: age, dtype: float64

kNN imputer

In [27]:
from sklearn.impute import KNNImputer
knn=KNNImputer(n_neighbors=2)
knn.fit_transform(data1[['age']])

array([[31.],
       [32.],
       [33.],
       [32.]])

In [28]:
data1

     Names   age     city
0   ramesh  31.0      NaN
1   suresh  32.0      hyd
2  sathish  33.0   mumbai
3   mahesh   NaN  chennai

method-6